app/controllers/plans_controller.rb

  def index
    @plans = Plan.all
---
SELECT "plans".* FROM "plans"

  def show
    @plan = Plan.find(params[:id])
---
SELECT  "plans".* FROM "plans" WHERE "plans"."id" = ? LIMIT 1  [["id", 1]]

  def edit
    @plan = Plan.find(params[:id])
---
SELECT  "plans".* FROM "plans" WHERE "plans"."id" = ? LIMIT 1  [["id", 1]]

  def create
    @plan = Plan.new(plan_params)
    if @plan.save
---
INSERT INTO "plans" ("name", "slots", "price", "tickets", "discount_coupon", "discount_tickets", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @plan = Plan.find(params[:id])

    if @plan.update(plan_params)
---
SELECT  "plans".* FROM "plans" WHERE "plans"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "plans" SET "name" = ?, "updated_at" = ? WHERE "plans"."id" = ?  [["name", "sum plano"], ["updated_at", "2015-04-29 14:23:11.391838"], ["id", 1]]